
[FOXDAMAGETYPE_CRUSHED]
killstrings=killed %s
killstrings=crushed %s
killstrings=flattened %s
suicidestrings=was flattened
suicidestrings=was crushed

[FOXDAMAGETYPE_HARDSUITAUTOCANNON]
suicidestrings=suicide
killstrings=killed %s
killstrings=Auto cannoned %s
killstrings=showed %s the wrath of the Auto cannon

[FOXDAMAGETYPE_HARDSUITCANNON]
suicidestrings=suicide
killstrings=killed %s
killstrings=cannoned %s
killstrings=showed %s the wrath of the cannon

[FOXDAMAGETYPE_HARDSUITHMG]
suicidestrings=suicide
killstrings=killed %s
killstrings=minigunned %s
killstrings=cut down %s with a minigun

[FOXDAMAGETYPE_TURRET]
suicidestrings=suicide
killstrings=killed %s with a turret
killstrings=turret killed %s
killstrings=turreted %s

[FOXWEAPON_HARDSUITAUTOCANNON]
friendlyname=Hardsuit Auto-Cannon

[FOXWEAPON_HARDSUITCANNON]
friendlyname=Hardsuit Railgun

[FOXWEAPON_HARDSUITHMG]
friendlyname=Hardsuit Minigun

[FOXWEAPON_HARDSUITSMOKE]
friendlyname=Hardsuit Digi Grenade
